CSI API ETABS v1
cAnalysisResultsSetup.GetOptionBucklingMode Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOptionBucklingMode(
	ref int BuckModeStart,
	ref int BuckModeEnd,
	ref bool BuckModeAll
)
Function GetOptionBucklingMode (
	ByRef BuckModeStart As Integer,
	ByRef BuckModeEnd As Integer,
	ByRef BuckModeAll As Boolean
) As Integer
Dim instance As cAnalysisResultsSetup
Dim BuckModeStart As Integer
Dim BuckModeEnd As Integer
Dim BuckModeAll As Boolean
Dim returnValue As Integer
returnValue = instance.GetOptionBucklingMode(BuckModeStart,
	BuckModeEnd, BuckModeAll)
int GetOptionBucklingMode(
	int% BuckModeStart,
	int% BuckModeEnd,
	bool% BuckModeAll
)
abstract GetOptionBucklingMode :
        BuckModeStart : int byref *
        BuckModeEnd : int byref *
        BuckModeAll : bool byref -> int
Parameters
BuckModeStart
Type: System.Int32
BuckModeEnd
Type: System.Int32
BuckModeAll
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace